app/controllers/api/v1/users/sessions_controller.rb

        def create
          email = params[:user][:email]
          user = User.find_by(email:)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ritankemdaniel@gmail.com"], ["LIMIT", 1]]