app/controllers/api/v1/events_controller.rb

      def create
        @event = Event.new(event_params)

        if @event.save
---
INSERT INTO "events" ("title", "date", "time", "description", "user_id", "venue_id", "created_at", "updated_at", "images") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

      def update
        if @event.update(event_params)
---
UPDATE "events" SET "updated_at" = $1, "images" = $2 WHERE "events"."id" = $3  [["updated_at", "2023-06-23 08:20:16.427439"], ["images", "https://images.pexels.com/photos/2263436/pexels-photo-2263436.jpeg?auto=compress&cs=tinysrgb&w=600"], ["id", 1]]