app/controllers/api/v1/reservations_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" IN ($1, $2)  [["id", 8], ["id", 4]]
SELECT "reservations".* FROM "reservations"
---
      def index
        @reservations = Reservation.includes(ticket: :event).all

INSERT INTO "reservations" ("ticket_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ticket_id", 23], ["user_id", 1], ["created_at", "2023-06-26 18:20:12.598213"], ["updated_at", "2023-06-26 18:20:12.598213"]]
---
      def create
        @reservation = Reservation.new(reservation_params)
        if @reservation.save