app/controllers/api/v1/tickets_controller.rb

INSERT INTO "tickets" ("event_id", "user_id", "quantity", "price", "ticket_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["event_id", 3], ["user_id", 1], ["quantity", 13], ["price", 20000.0], ["ticket_type", "tech"], ["created_at", "2023-06-24 17:43:12.656522"], ["updated_at", "2023-06-24 17:43:12.656522"]]
---
  def create
    @ticket = Ticket.new(ticket_params)

    if @ticket.save