app/controllers/api/v1/venues_controller.rb

INSERT INTO "venues" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "women in tech"], ["location", "Abuja"], ["created_at", "2023-06-20 12:40:04.282859"], ["updated_at", "2023-06-20 12:40:04.282859"]]
---
      def create
        @venue = Venue.new(venue_params)

        if @venue.save